-- 检查是否存在重复的 StaffTel 记录
SELECT StaffTel, COUNT(*) as count
FROM user
GROUP BY StaffTel;

INSERT INTO Departments
(DeptName, SupportChannels, SuperiorDept, ShiftType, AttendanceDay, AttendanceRule1Start, AttendanceRule1End, AttendanceRule2Start, AttendanceRule2End, ClearTime)
VALUES
    ('二线考勤组', '1111111111111111', -1, 0, '1234567', '0830', '1200', '1300', '1630', '0000'),
    ('后勤保障组', '1111111111111100', -1, 1, NULL, '0400', '0359', NULL, NULL, '0000'),
    ('一线考勤组现场区域一班', '1111111111110000', -1, 2, NULL, '0830', '1530', NULL, NULL, '0000'),
    ('一线考勤组现场区域二班', '1111111111110000', -1, 2, NULL, '0930', '1630', NULL, NULL, '0000'),
    ('动力维修部(指挥中心，电工)一班', '1111111111000000', -1, 2, NULL, '0830', '1530', NULL, NULL, '0000'),
    ('动力维修部(指挥中心，电工)二班', '1111111111000000', -1, 2, NULL, '0930', '1630', NULL, NULL, '0000'),
    ('峡谷游船组夜班一班', '1111111100000000', -1, 2, NULL, '1800', '0600', NULL, NULL, '0000'),
    ('峡谷游船组夜班二班', '1111111100000000', -1, 2, NULL, '1800', '0830', NULL, NULL, '0000'),
    ('峡谷游船组现场区域一班', '1111111100000000', -1, 2, NULL, '0830', '1530', NULL, NULL, '0000'),
    ('峡谷游船组现场区域二班', '1111111100000000', -1, 2, NULL, '0930', '1630', NULL, NULL, '0000'),
    ('张家界大峡谷网络运营有限公司现场区域一班', '1111110000000000', -1, 2, NULL, '0830', '1530', NULL, NULL, '0000'),
    ('张家界大峡谷网络运营有限公司现场区域二班', '1111110000000000', -1, 2, NULL, '0930', '1630', NULL, NULL, '0000'),
    ('中心区域(夜班)', '1111000000000000', -1, 0, '1234567', '1600', '0830', NULL, NULL, '0000'),
    ('动力维修部(指挥中心2)二线部门办公室', '1111000000000000', -1, 2, NULL, '0830', '1200', '1300', '1630', '0000'),
    ('动力维修部(指挥中心2)一班', '1111000000000000', -1, 2, NULL, '0830', '1530', NULL, NULL, '0000'),
    ('动力维修部(指挥中心2)二班', '1111000000000000', -1, 2, NULL, '0930', '1630', NULL, NULL, '0000'),
    ('行政部考勤组二线部门办公室', '1100000000000000', -1, 2, NULL, '0830', '1200', '1300', '1630', '0000'),
    ('行政部考勤组行政部', '1100000000000000', -1, 2, NULL, '0830', '1600', NULL, NULL, '0000');